jagumiel/LIN-Automotive/Training/1-LIN-Master-Slave-COM/Slave-LIN/LIN_Slave_CY8CKIT-042.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "LINS.h"
#include "LED_RED.h"
#include "LED_RED_aliases.h"
#include "LED_GREEN.h"
#include "LED_GREEN_aliases.h"
#include "LED_BLUE.h"
#include "LED_BLUE_aliases.h"
#include "NSLP.h"
#include "NSLP_aliases.h"
#include "LINS_ISR.h"
#include "LINS_IntClk.h"
#include "LINS_SCB.h"
#include "LINS_SCB_SPI_UART.h"
#include "LINS_SCB_PINS.h"
#include "LINS_SCB_SPI_UART_PVT.h"
#include "LINS_SCB_PVT.h"
#include "LINS_SCB_BOOT.h"
#include "LINS_SCB_tx.h"
#include "LINS_SCB_tx_aliases.h"
#include "LINS_SCB_rx.h"
#include "LINS_SCB_rx_aliases.h"
#include "cy_em_eeprom.h"
#include "LIN_Dynamic.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"

/*[]*/

